Masmiseim36/nxpSDK/devices/MIMXRT758S/drivers/fsl_power.h
#define SHA_MED_CCTRL0_OFFSET 0U
#define SHA_MED_TCTRL0_OFFSET 1U
#define SHA_SEN_TCTRL0_OFFSET 3U
#define PRIVATE_CCTRL0_OFFSET 4U
#define PRIVATE_TCTRL0_OFFSET 5U
#define PRIVATE_TCTRL1_OFFSET 6U
#define PRIVATE_TCTRL2_OFFSET 7U

#define SHA_MED_CSTAT0_OFFSET    0U /*0x1D0 */
#define SHA_MEDSEN_TSTAT0_OFFSET 1U /* 0x1D4 */
#define PRIVATE_CSTAT0_OFFSET    4U /* 0x1E0 */
#define PRIVATE_TSTAT0_OFFSET    5U /* 0x1E4 */
#define PRIVATE_TSTAT1_OFFSET    6U /* 0x1E8 */

#define POWER_LP_REQ_CTRL_REG_OFFSET  (5U)
#define POWER_LP_REQ_STATE_REG_OFFSET (13U)
#define POWER_LP_REQ_STATE_BIT_OFFSET (8U)
#define POWER_MAKE_LP_BITS(ctrl_reg, ctrl_bit, state_reg, state_bit)                                              \
    (((ctrl_reg) << POWER_LP_REQ_CTRL_REG_OFFSET) | (ctrl_bit) | ((state_bit) << POWER_LP_REQ_STATE_BIT_OFFSET) | \
     ((state_reg) << POWER_LP_REQ_STATE_REG_OFFSET))
#define GET_LP_CTRL_REG_FROM_BITS(bit)  (((uint32_t)(bit) >> POWER_LP_REQ_CTRL_REG_OFFSET) & 0x7U)
#define GET_LP_CTRL_BIT_FROM_BITS(bit)  (((uint32_t)(bit)) & 0x1FU)
#define GET_LP_STATE_REG_FROM_BITS(bit) (((uint32_t)(bit) >> POWER_LP_REQ_STATE_REG_OFFSET) & 0x7U)
#define GET_LP_STATE_BIT_FROM_BITS(bit) ((((uint32_t)(bit)) >> POWER_LP_REQ_STATE_BIT_OFFSET) & 0x1FU)

/*! @brief low power control bits for modules. Bits used for modules to requesting low-power. */
typedef enum lp_bits
{
    kPower_VGPU_LPREQ =
        POWER_MAKE_LP_BITS(SHA_MED_CCTRL0_OFFSET, 0U, SHA_MED_CSTAT0_OFFSET, 0U), /*!< VGPU low power request. */
    kPower_EZHV_STOP =
        POWER_MAKE_LP_BITS(SHA_MED_CCTRL0_OFFSET, 1U, SHA_MED_CSTAT0_OFFSET, 2U), /*!< EZHV stop request. */
    kPower_EZHV_HALT =
        POWER_MAKE_LP_BITS(SHA_MED_CCTRL0_OFFSET, 2U, SHA_MED_CSTAT0_OFFSET, 3U), /*!< EZHV halt request. */
    kPower_EZHV_EXIT_WAIT =
        POWER_MAKE_LP_BITS(SHA_MED_CCTRL0_OFFSET, 3U, SHA_MED_CSTAT0_OFFSET, 4U), /*!< EZHV exit wait request. */

    kPower_XSPI2_STOP =
        POWER_MAKE_LP_BITS(SHA_MED_TCTRL0_OFFSET, 0U, SHA_MEDSEN_TSTAT0_OFFSET, 0U), /*!< XSPI2 stop request. */
    kPower_LPSPI14_B_LPREQ = POWER_MAKE_LP_BITS(
        SHA_MED_TCTRL0_OFFSET, 3U, SHA_MEDSEN_TSTAT0_OFFSET, 1U),  /*!< LPSPI14 bus low power request. */
    kPower_LPSPI14_F_LPREQ = POWER_MAKE_LP_BITS(
        SHA_MED_TCTRL0_OFFSET, 4U, SHA_MEDSEN_TSTAT0_OFFSET, 2U),  /*!< LPSPI14 function low power request.*/
    kPower_LPSPI16_B_LPREQ = POWER_MAKE_LP_BITS(
        SHA_MED_TCTRL0_OFFSET, 6U, SHA_MEDSEN_TSTAT0_OFFSET, 3U),  /*!< LPSPI16 bus low power request. */
    kPower_LPSPI16_F_LPREQ = POWER_MAKE_LP_BITS(
        SHA_MED_TCTRL0_OFFSET, 7U, SHA_MEDSEN_TSTAT0_OFFSET, 4U),  /*!< LPSPI16 function low power request. */
    kPower_FLEXIO_B_LPREQ = POWER_MAKE_LP_BITS(
        SHA_MED_TCTRL0_OFFSET, 9U, SHA_MEDSEN_TSTAT0_OFFSET, 5U),  /*!< FLEXIO bus low power request. */
    kPower_FLEXIO_F_LPREQ = POWER_MAKE_LP_BITS(
        SHA_MED_TCTRL0_OFFSET, 10U, SHA_MEDSEN_TSTAT0_OFFSET, 6U), /*!< FLEXIO function low power request. */
    kPower_NIC0_LPREQ =
        POWER_MAKE_LP_BITS(SHA_MED_TCTRL0_OFFSET, 11U, SHA_MEDSEN_TSTAT0_OFFSET, 7U), /*!< NIC0 low power request. */
    kPower_NIC1_LPREQ =
        POWER_MAKE_LP_BITS(SHA_MED_TCTRL0_OFFSET, 12U, SHA_MEDSEN_TSTAT0_OFFSET, 8U), /*!< NIC1 low power request. */

    kPower_ADC0_STOP =
        POWER_MAKE_LP_BITS(SHA_SEN_TCTRL0_OFFSET, 0U, SHA_MEDSEN_TSTAT0_OFFSET, 16U), /*!< ADC0 stop request. */
    kPower_ACMP0_STOP =
        POWER_MAKE_LP_BITS(SHA_SEN_TCTRL0_OFFSET, 2U, SHA_MEDSEN_TSTAT0_OFFSET, 17U), /*!< ACMP0 stop request. */
    kPower_MICFIL_STOP =
        POWER_MAKE_LP_BITS(SHA_SEN_TCTRL0_OFFSET, 3U, SHA_MEDSEN_TSTAT0_OFFSET, 18U), /*!< MICFIL stop request. */
    kPower_LPI2C15_B_LPREQ = POWER_MAKE_LP_BITS(
        SHA_SEN_TCTRL0_OFFSET, 5U, SHA_MEDSEN_TSTAT0_OFFSET, 19U), /*!< LPI2C15 bus low power request. */
    kPower_LPI2C15_F_LPREQ = POWER_MAKE_LP_BITS(
        SHA_SEN_TCTRL0_OFFSET, 7U, SHA_MEDSEN_TSTAT0_OFFSET, 20U), /*!< LPI2C15 function low power request. */
    kPower_GDET3_LPREQ =
        POWER_MAKE_LP_BITS(SHA_SEN_TCTRL0_OFFSET, 9U, SHA_MEDSEN_TSTAT0_OFFSET, 22U), /*!< GDET3 low power request. */
    kPower_RTC_STOP = POWER_MAKE_LP_BITS(
        SHA_SEN_TCTRL0_OFFSET, 31U, SHA_MEDSEN_TSTAT0_OFFSET, 31U), /*!< RTC0 and RTC1 stop request. */

#if defined(PMC0)
    kPower_EDMA0_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_CCTRL0_OFFSET, 0U, PRIVATE_CSTAT0_OFFSET, 0U), /*!< EDMA0 stop request. */
    kPower_EDMA1_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_CCTRL0_OFFSET, 1U, PRIVATE_CSTAT0_OFFSET, 1U), /*!< EDMA1 stop request. */

    kPower_FC0_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 0U, PRIVATE_TSTAT0_OFFSET, 0U),   /*!< LP_FLEXCOMM0 bus low power request. */
    kPower_FC1_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 1U, PRIVATE_TSTAT0_OFFSET, 1U),   /*!< LP_FLEXCOMM1 bus low power request. */
    kPower_FC2_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 2U, PRIVATE_TSTAT0_OFFSET, 2U),   /*!< LP_FLEXCOMM2 bus low power request. */
    kPower_FC3_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 3U, PRIVATE_TSTAT0_OFFSET, 3U),   /*!< LP_FLEXCOMM3 bus low power request. */
    kPower_FC4_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 4U, PRIVATE_TSTAT0_OFFSET, 4U),   /*!< LP_FLEXCOMM4 bus low power request. */
    kPower_FC5_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 5U, PRIVATE_TSTAT0_OFFSET, 5U),   /*!< LP_FLEXCOMM5 bus low power request. */
    kPower_FC6_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 6U, PRIVATE_TSTAT0_OFFSET, 6U),   /*!< LP_FLEXCOMM6 bus low power request. */
    kPower_FC7_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 7U, PRIVATE_TSTAT0_OFFSET, 7U),   /*!< LP_FLEXCOMM7 bus low power request. */
    kPower_FC8_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 8U, PRIVATE_TSTAT0_OFFSET, 8U),   /*!< LP_FLEXCOMM8 bus low power request. */
    kPower_FC9_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 9U, PRIVATE_TSTAT0_OFFSET, 9U),   /*!< LP_FLEXCOMM9 bus low power request. */
    kPower_FC10_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 10U, PRIVATE_TSTAT0_OFFSET, 10U), /*!< LP_FLEXCOMM10 bus low power request. */
    kPower_FC11_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 11U, PRIVATE_TSTAT0_OFFSET, 11U), /*!< LP_FLEXCOMM11 bus low power request. */
    kPower_FC12_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 12U, PRIVATE_TSTAT0_OFFSET, 12U), /*!< LP_FLEXCOMM12 bus low power request. */
    kPower_FC13_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 13U, PRIVATE_TSTAT0_OFFSET, 13U), /*!< LP_FLEXCOMM13 bus low power request. */
    kPower_FC0_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 0U, PRIVATE_TSTAT0_OFFSET, 16U),  /*!< LP_FLEXCOMM0 function low power request. */
    kPower_FC1_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 1U, PRIVATE_TSTAT0_OFFSET, 17U),  /*!< LP_FLEXCOMM1 function low power request. */
    kPower_FC2_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 2U, PRIVATE_TSTAT0_OFFSET, 18U),  /*!< LP_FLEXCOMM2 function low power request. */
    kPower_FC3_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 3U, PRIVATE_TSTAT0_OFFSET, 19U),  /*!< LP_FLEXCOMM3 function low power request. */
    kPower_FC4_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 4U, PRIVATE_TSTAT0_OFFSET, 20U),  /*!< LP_FLEXCOMM4 function low power request. */
    kPower_FC5_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 5U, PRIVATE_TSTAT0_OFFSET, 21U),  /*!< LP_FLEXCOMM5 function low power request. */
    kPower_FC6_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 6U, PRIVATE_TSTAT0_OFFSET, 22U),  /*!< LP_FLEXCOMM6 function low power request. */
    kPower_FC7_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 7U, PRIVATE_TSTAT0_OFFSET, 23U),  /*!< LP_FLEXCOMM7 function low power request. */
    kPower_FC8_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 8U, PRIVATE_TSTAT0_OFFSET, 24U),  /*!< LP_FLEXCOMM8 function low power request. */
    kPower_FC9_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 9U, PRIVATE_TSTAT0_OFFSET, 25U),  /*!< LP_FLEXCOMM9 function low power request. */
    kPower_FC10_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 10U, PRIVATE_TSTAT0_OFFSET, 26U), /*!< LP_FLEXCOMM10 function low power request. */
    kPower_FC11_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 11U, PRIVATE_TSTAT0_OFFSET, 27U), /*!< LP_FLEXCOMM11 function low power request. */
    kPower_FC12_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 12U, PRIVATE_TSTAT0_OFFSET, 28U), /*!< LP_FLEXCOMM12 function low power request. */
    kPower_FC13_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL1_OFFSET, 13U, PRIVATE_TSTAT0_OFFSET, 29U), /*!< LP_FLEXCOMM13 function low power request. */

    kPower_GPIO0_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 0U, PRIVATE_TSTAT1_OFFSET, 2U),   /*!< GPIO0 low power request. */
    kPower_GPIO1_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 1U, PRIVATE_TSTAT1_OFFSET, 3U),   /*!< GPIO1 low power request. */
    kPower_GPIO2_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 2U, PRIVATE_TSTAT1_OFFSET, 4U),   /*!< GPIO2 low power request. */
    kPower_GPIO3_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 3U, PRIVATE_TSTAT1_OFFSET, 5U),   /*!< GPIO3 low power request. */
    kPower_GPIO4_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 4U, PRIVATE_TSTAT1_OFFSET, 6U),   /*!< GPIO4 low power request. */
    kPower_GPIO5_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 5U, PRIVATE_TSTAT1_OFFSET, 7U),   /*!< GPIO5 low power request. */
    kPower_GPIO6_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 6U, PRIVATE_TSTAT1_OFFSET, 8U),   /*!< GPIO6 low power request. */
    kPower_GPIO7_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 7U, PRIVATE_TSTAT1_OFFSET, 9U),   /*!< GPIO7 low power request. */
    kPower_SAI0_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 8U, PRIVATE_TSTAT1_OFFSET, 10U),  /*!< SAI0 low power request. */
    kPower_SAI1_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 9U, PRIVATE_TSTAT1_OFFSET, 11U),  /*!< SAI1 low power request. */
    kPower_SAI2_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 10U, PRIVATE_TSTAT1_OFFSET, 12U), /*!< SAI2 low power request. */
    kPower_TRNG_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 11U, PRIVATE_TSTAT1_OFFSET, 13U), /*!< TRNG stop request. */
    kPower_XSPI0_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 12U, PRIVATE_TSTAT1_OFFSET, 14U), /*!< XSPI0 stop request. */
    kPower_XSPI1_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 14U, PRIVATE_TSTAT1_OFFSET, 15U), /*!< XSPI1 stop request. */
    kPower_I3C0_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 16U, PRIVATE_TSTAT1_OFFSET, 16U), /*!< I3C0 stop request. */
    kPower_I3C1_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 17U, PRIVATE_TSTAT1_OFFSET, 17U), /*!< I3C1 stop request. */
    kPower_GDET0_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL2_OFFSET, 18U, PRIVATE_TSTAT1_OFFSET, 0U),  /*!< GDET0 low power request. */
#else
    kPower_EDMA2_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_CCTRL0_OFFSET, 0U, PRIVATE_CSTAT0_OFFSET, 0U), /*!< EDMA2 stop request. */
    kPower_EDMA3_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_CCTRL0_OFFSET, 1U, PRIVATE_CSTAT0_OFFSET, 1U), /*!< EDMA3 stop request. */

    kPower_FC17_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 0U, PRIVATE_TSTAT0_OFFSET, 0U),  /*!< LP_FLEXCOMM17 bus low power request. */
    kPower_FC18_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 1U, PRIVATE_TSTAT0_OFFSET, 1U),  /*!< LP_FLEXCOMM18 bus low power request. */
    kPower_FC19_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 2U, PRIVATE_TSTAT0_OFFSET, 2U),  /*!< LP_FLEXCOMM19 bus low power request. */
    kPower_FC20_B_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 3U, PRIVATE_TSTAT0_OFFSET, 3U),  /*!< LP_FLEXCOMM20 bus low power request. */
    kPower_FC17_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 4U, PRIVATE_TSTAT0_OFFSET, 16U), /*!< LP_FLEXCOMM17 function low power request. */
    kPower_FC18_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 5U, PRIVATE_TSTAT0_OFFSET, 17U), /*!< LP_FLEXCOMM18 function low power request. */
    kPower_FC19_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 6U, PRIVATE_TSTAT0_OFFSET, 18U), /*!< LP_FLEXCOMM19 function low power request. */
    kPower_FC20_F_LPREQ = POWER_MAKE_LP_BITS(
        PRIVATE_TCTRL0_OFFSET, 7U, PRIVATE_TSTAT0_OFFSET, 19U), /*!< LP_FLEXCOMM20 function low power request. */
    kPower_SAI3_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL0_OFFSET, 8U, PRIVATE_TSTAT0_OFFSET, 4U),  /*!< SAI3 low power request. */
    kPower_GPIO8_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL0_OFFSET, 9U, PRIVATE_TSTAT0_OFFSET, 5U),  /*!< GPIO8 low power request. */
    kPower_GPIO9_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL0_OFFSET, 10U, PRIVATE_TSTAT0_OFFSET, 6U), /*!< GPIO9 low power request. */
    kPower_GPIO10_LPREQ =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL0_OFFSET, 11U, PRIVATE_TSTAT0_OFFSET, 7U), /*!< GPIO10 low power request. */
    kPower_I3C2_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL0_OFFSET, 20U, PRIVATE_TSTAT0_OFFSET, 8U), /*!< I3C2 low power request. */
    kPower_I3C3_STOP =
        POWER_MAKE_LP_BITS(PRIVATE_TCTRL0_OFFSET, 21U, PRIVATE_TSTAT0_OFFSET, 9U), /*!< I3C3 low power request. */
#endif
} lp_bit_t;

