Masmiseim36/nxpSDK/devices/MIMXRT758S/drivers/fsl_power.h
/*! @brief PMIC mode pin configuration API parameter */
typedef enum _pmic_mode_reg
{
    kCfg_Run   = 0xA0U, /*!< PDRUNCFG0 register offset. */
    kCfg_Sleep = 0xB8U, /*!< PDSLEEPCFG0 register offset. */
} pmic_mode_reg_t;

/*! @brief Power mode configuration API parameter */
typedef enum _power_mode_config
{
    kPower_Sleep              = 0U, /*!< Sleep mode. */
    kPower_DeepSleep          = 1U, /*!< Deep Sleep mode. */
    kPower_DeepSleepRetention = 2U, /*!< Deep Sleep Retention(DSR) mode. */
    kPower_DeepPowerDown      = 3U, /*!< Deep Power Down(DPD) mode. */
    kPower_FullDeepPowerDown  = 4U, /*!< Full Deep Power Down(FDPD) mode. */
} power_mode_cfg_t;

/*!
 * @brief DMA Wakeup sources.
 *
 */
enum _power_hwwake_src
{
    kPower_HWWakeSrcFlexio     = 0x2U, /*!< Enables DMA to wakeup by FLEXIO DMA request.*/
    kPower_HWWakeSrcLpFlexcomm = 0x4U, /*!< Enables DMA to wakeup by LP_FLEXCOMM0-13(CPU0), LP_FLEXCOMM17-20(CPU1) DMA
                                   request.*/
#if defined(SLEEPCON_COMPT)
    kPower_HWWakeSrcHsSpi = 0x8U,      /*!< Enables DMA to wakeup by LPSPI14 and LPSPI16 DMA request.*/
#endif
    kPower_HWWakeSrcSai = 0x10U,       /*!< Enables DMA to wakeup by SAI0-2(CPU0), SAI3(CPU1) request.*/
};

/*!
 * @brief Definition for shared resources.
 *
 */
enum _power_shared_resource_mask
{
    kPower_MaskAdc0    = 0x1U,      /*!< ADC0 mask.*/
    kPower_MaskAcmp0   = 0x2U,      /*!< ACMP0 mask.*/
    kPower_MaskMicfil  = 0x4U,      /*!< MICFIL mask.*/
    kPower_MaskLpi2c15 = 0x8U,      /*!< LPI2C15 mask.*/
    kPower_MaskGdet3   = 0x20U,     /*!< GDET3 mask.*/
    kPower_MaskRtc     = 0x40U,     /*!< RTC mask.*/
    kPower_MaskVgpu    = 0x10000U,  /*!< VGPU mask.*/
    kPower_MaskEzhv    = 0x20000U,  /*!< EZHV mask.*/
    kPower_MaskXspi2   = 0x40000U,  /*!< XSPI2 mask.*/
    kPower_MaskLpspi14 = 0x80000U,  /*!< LPSPI14 mask.*/
    kPower_MaskLpspi16 = 0x100000U, /*!< LPSPI16 mask.*/
    kPower_MaskFlexio  = 0x200000U, /*!< FlexIO mask.*/
    kPower_MaskNic0    = 0x400000U, /*!< NIC0 mask.*/
    kPower_MaskNic1    = 0x800000U, /*!< NIC1 mask.*/
    kPower_MaskAll     = 0xFF007FU, /*!< Mask all shared modules.*/
};

/*!
 * @brief pad voltage range value for the 3V capable IOs. To reduce power the IOs can be configured for 1.8V or 3.3V
operation, powering down the detector, but requiring the application to restrict the IO supply voltage to the selected
range.
 */
typedef enum _power_pad_vrange_val
{
    kPadVol_Continuous = 0U, /*!< Continuous mode, VDDE detector on. */
    kPadVol_171_198    = 1U, /*!< Voltage from 1.71V to 1.98V. supply detector off. */
    kPadVol_300_360    = 2U, /*!< Voltage from 3.00V to 3.60V. supply detector off. */
} power_pad_vrange_val_t;

/*! @brief Body Bias domain definition */
enum _body_bias_domain
{
    kPower_BodyBiasVdd2Sram = PMC_PDRUNCFG0_RBBSR2_PD_MASK, /*!< VDD2 domain RAMs. */
    kPower_BodyBiasVdd1Sram = PMC_PDRUNCFG0_RBBSR1_PD_MASK, /*!< VDD1 domain RAMs. */
    kPower_BodyBiasVddn     = PMC_PDRUNCFG0_RBBN_PD_MASK,   /*!< VDDN domain. */
    kPower_BodyBiasVdd2     = PMC_PDRUNCFG0_RBB2_PD_MASK,   /*!< VDD2 domain. */
    kPower_BodyBiasVdd1     = PMC_PDRUNCFG0_RBB1_PD_MASK,   /*!< VDD1 domain. */
};

/*! @brief Regulator definition for Regulator and LVD configuration. */
typedef enum _power_regulator
{
    kRegulator_DCDC    = 0U, /*!< DCDC used for VDDN. */
    kRegulator_Vdd2LDO = 1U, /*!< VDD2 LDO. */
    kRegulator_Vdd1LDO = 2U, /*!< VDD1 LDO. */
} power_regulator_t;

/*!
 * @brief Regulator voltage configuraton. Configure the regulator voltage in uV.
 */
typedef union _power_regulator_voltage
{
    struct
    {
        uint32_t vsel0; /*!< DCDC VSEL0. Voltage = 0.5 V + 6.25 mV * value of vsel0. Maximum value = 1150000uV. */
        uint32_t vsel1; /*!< DCDC VSEL1. Voltage = 0.5 V + 6.25 mV * value of vsel1. Maximum value = 1150000uV. */
    } DCDC;
    struct
    {
        uint32_t vsel0; /*!< LDO VSEL0. Voltage = 0.45 V + 12.5 mV * vsel0. Maximum value = 1150000uV. */
        uint32_t vsel1; /*!< LDO VSEL1. Voltage = 0.45 V + 12.5 mV * vsel1. Maximum value = 1150000uV.*/
        uint32_t vsel2; /*!< LDO VSEL2. Voltage = 0.45 V + 12.5 mV * vsel2. Maximum value = 1150000uV. */
        uint32_t vsel3; /*!< LDO VSEL3. Voltage = 0.45 V + 12.5 mV * vsel3. Maximum value = 1150000uV. */
    } LDO;
    uint32_t vsel[4];
} power_regulator_voltage_t;

/*!
 * @brief LDO mode definition.
 */
enum _power_ldo_mode
{
    kPower_LDOMode_Bypass = 0U, /*!< LDO Bypass mode. */
    kPower_LDOMode_HP     = 1U, /*!< LDO High Power mode. */
    kPower_LDOMode_LP     = 2U, /*!< LDO Low Power mode. */
};

/*!
 * @brief DCDC mode definition.
 */
enum _power_dcdc_mode
{
    kPower_DCDCMode_HP = 0U,  /*!< DCDC High Power mode. */
    kPower_DCDCMode_LP = 1U,  /*!< DCDC Low Power mode. */
    kPower_DCDCMode_ULP = 3U, /*!< DCDC Ultra Low Power mode. A0 Silicon does not support this mode and will default to low power mode when configured. */
};

/*! @brief VDDN, VDD1 or VDD2 supply source. */
typedef enum _power_vdd_src
{
    kVddSrc_PMC  = 0U, /*!< Supplied by onchip regulator in PMC, DCDC for VDDN, LDO1 for VDD1, LDO2 for VDD2. */
    kVddSrc_PMIC = 1U, /*!< Supplied by external PMIC. */
} power_vdd_src_t;

/*!
 * @brief LVD voltage configuraton. Configure the LVD voltage in uV. Falling trip = 0.5V + 10 mV * bitfield value.
 */
typedef union _power_lvd_voltage
{
    struct
    {
        uint32_t lvl0; /*!< VDDN LVD level0, uV. */
        uint32_t lvl1; /*!< VDDN LVD level1, uV. */
    } VDDN;
    struct
    {
        uint32_t lvl0; /*!< VDD1/2 LVD level0, uV. */
        uint32_t lvl1; /*!< VDD1/2 LVD level1, uV. */
        uint32_t lvl2; /*!< VDD1/2 LVD level2, uV. */
        uint32_t lvl3; /*!< VDD1/2 LVD level3, uV. */
    } VDD12;
    uint32_t lvl[4];
} power_lvd_voltage_t;

#if defined(PMC0)

/*! @brief Internal Regulator and LDO power control bits */
enum _power_regulator_pd_control
{
    kPower_SCPC    = PMC_POWERCFG_SCPCPD_MASK, /*!< SCPC Power control, controls both SCPCs, for all power mode. */
    kPower_Vdd1LDO = PMC_POWERCFG_LDO1PD_MASK, /*!< LDO VDD1 Power control, for all power mode. */
    kPower_Vdd2LDO = PMC_POWERCFG_LDO2PD_MASK, /*!< LDO VDD2 Power control, for all power mode. */
    kPower_DCDC    = PMC_POWERCFG_DCDCPD_MASK, /*!< DCDC Power control, for all power mode. */
};

/*! @brief Internal Regulator and LDO power control bits for FDSR power mode. */
enum _power_regulator_pd_control_fdsr
{
    kPower_Vdd1SCPC_FDSR =
        PMC_POWERCFG_FDSCP1PD_MASK, /*!< SCPC VDD1 Power control in FDSR mode, overridden when [SCPCPD]=1. */
    kPower_Vdd2SCPC_FDSR =
        PMC_POWERCFG_FDSCP2PD_MASK, /*!< SCPC VDD2 Power control in FDSR mode, overridden when [SCPCPD]=1. */
    kPower_Vdd1LDO_FDSR =
        PMC_POWERCFG_FDLDO1PD_MASK, /*!< LDO VDD1 Power control in FDSR mode, overridden when [LPO1PD]=1. */
    kPower_Vdd2LDO_FDSR =
        PMC_POWERCFG_FDLDO2PD_MASK, /*!< LDO VDD2 Power control in FDSR mode, overridden when [LPO2PD]=1. */
    kPower_DCDC_FDSR = PMC_POWERCFG_FDDCPD_MASK, /*!< DCDC Power control in FDSR mode, overridden when [DCDCPD]=1. */
};

/*! @brief RBB Body Bias voltage definition */
typedef enum _body_bias_voltage
{
    kBodyBias_1V0 = 0U, /*!< Reverse Body Bias Voltage 1.0V. */
    kBodyBias_1V3 = 1U, /*!< Reverse Body Bias Voltage 1.3V. */
} body_bias_voltage_t;

/*!
 * @brief RBB Body Bias voltage. 0b - Voltage is set to 1.0V, 1b - Voltage is set to 1.3V.
 */
typedef struct _power_rbb_voltage
{
    uint32_t rbbVdd1 : 1; /*!< Reverse Body Bias Voltage for VDD1 Domain. @ref body_bias_voltage_t */
    uint32_t : 7;         /*!< Reserved. */
    uint32_t rbbVdd2 : 1; /*!< Reverse Body Bias Voltage for VDD2 Domain. @ref body_bias_voltage_t */
    uint32_t : 7;         /*!< Reserved. */
    uint32_t rbbVddn : 1; /*!< Reverse Body Bias Voltage for VDDN Domain. @ref body_bias_voltage_t */
    uint32_t : 15;        /*!< Reserved. */
} power_rbb_voltage_t;

/*!
 * @brief POR voltage. Falling trip voltage = 0.4 + 10 mV * value.
 */
typedef struct _power_por_voltage
{
    uint32_t Vdd1Lvl : 5; /*!< POR falling trip value in VDD1 Domain, falling trip voltage = 0.4 + 10 mV * value. */
    uint32_t : 3;         /*!< Reserved. */
    uint32_t Vdd2Lvl : 5; /*!< POR falling trip value in VDD2 Domain, falling trip voltage = 0.4 + 10 mV * value. */
    uint32_t : 3;         /*!< Reserved. */
    uint32_t VddnLvl : 5; /*!< POR falling trip value in VDDN Domain, falling trip voltage = 0.4 + 10 mV * value. */
} power_por_voltage_t;

/*! @brief IO Banking bitmask.  */
typedef enum _power_io_bank
{
    kPower_IOBank0 = 0x1U,  /*!< Port 0/1/3 in VDD2_COM domain. */
    kPower_IOBank1 = 0x2U,  /*!< Port 2 in VDD2_COM domain. */
    kPower_IOBank2 = 0x4U,  /*!< Port 4 in VDDN_COM domain. */
    kPower_IOBank3 = 0x8U,  /*!< Port 5 in VDD2_COM domain. */
    kPower_IOBank4 = 0x10U, /*!< Port 6 in VDD2_COM domain. */
    kPower_IOBank5 = 0x20U, /*!< Port 7 in VDD2_COM domain. */
    kPower_IOBank6 = 0x40U, /*!< Port 8/9/10 in VDD1_SENSE domain. */
    kPower_IOBank7 = 0x80U, /*!< PMIC_I2C in VDD1_SENSE domain. */
} power_io_bank_t;
#endif

