Masmiseim36/nxpSDK/devices/MIMXRT758S/drivers/fsl_power.h
#if defined(PMC0)
/*!
 * @brief Compute domain enter Deep Sleep Retention mode API.
 * Deep Sleep Retention (DSR) mode is a deeper low power state than Deep Sleep mode.  DSR does not provide the option to
 * keep selected module clocks on for wake-up. DSR mode allows significant portions of the chip to be powered-down while
 * maintaining some level of state retention.
 *
 * NOTE, the body bias and DCDC, LDO configurations in PMC_PDSLEECFG0 is not covered by this API, please use
 * @ref POWER_EnableSleepRBB or @ref POWER_EnableSleepNBB and @ref POWER_SelectSleepSetpoint for those settings.
 *
 * NOTE, the MAINPLL and AUDIO PLL need special power up sequence, so it can't be power down/on automatically during the
 * mode change. Application need turn off the PLL before the low power mode entry and re-initialize the PLL after
 * wakeup.
 *
 * @param   exclude_from_pd  Bit mask of the SLEEPCON_SLEEPCFG and PMC_PDSLEEPCFG0 ~ PMC_PDSLEEPCFG5 that needs to be
 * powered on(bits cleared) during the power mode. The configuration for PMC from Compute domain and Sense domain are
 * aggregated, and the higher power mode always wins.
 */
void POWER_EnterDSR(const uint32_t exclude_from_pd[7]);
#else
/*!
 * @brief Sense domain requests entering Deep Sleep Retention mode API. Deep Sleep Retention (DSR) mode is a deeper low
 * power state than Deep Sleep mode. DSR mode allows significant portions of the chip to be powered-down while
 * maintaining some level of state retention. The Sense domain can enter DSR mode only when all other domains are in DSR
 * mode. If the condition is false, the sense domain will be in a shallower power mode(Deep sleep mode).
 *
 * NOTE, the body bias and DCDC, LDO configurations in PMC_PDSLEECFG0 is not covered by this API, please use
 * @ref POWER_EnableSleepRBB or @ref POWER_EnableSleepNBB and @ref POWER_SelectSleepSetpoint for those settings.
 *
 * @param   exclude_from_pd  Bit mask of the SLEEPCON_SLEEPCFG and PMC_PDSLEEPCFG0 ~ PMC_PDSLEEPCFG5 that needs to be
 * powered on(bits cleared) during the power mode. The configuration for PMC from Compute domain and Sense domain are
 * aggregated, and the higher power mode always wins.
 */
void POWER_RequestDSR(const uint32_t exclude_from_pd[7]);
#endif
/*!
 * @brief The domain requests to enter Deep Power Down mode.
 * The Deep Power Down and Full Deep Power Down can occur only when both domains signal their intent to enter these
 * lower power modes. The configuration for PMC from Compute domain and Sense domain are aggregated, and the higher
 * power mode always wins.
 *
 * @param exclude_from_pd  Bit mask of the SLEEPCON_SLEEPCFG and PMC_PDSLEEPCFG0 ~ PMC_PDSLEEPCFG5 that needs to be
 * powered on during Deep Power Down.
 */
void POWER_RequestDeepPowerDown(const uint32_t exclude_from_pd[7]);

/*!
 * @brief The domain requests to enter Full Deep Power Down mode.
 * The Deep Power Down and Full Deep Power Down can occur only when both domains signal their intent to enter these
 * lower power modes. The configuration for PMC from Compute domain and Sense domain are aggregated, and the higher
 * power mode always wins.
 *
 * @param   exclude_from_pd  Bit mask of the SLEEPCON_SLEEPCFG and PMC_PDSLEEPCFG0 ~ PMC_PDSLEEPCFG5 that needs to be
 * powered on during Deep Power Down.
 */
void POWER_RequestFullDeepPowerDown(const uint32_t exclude_from_pd[7]);

/*!
 * @brief Power Library API to request entering different power mode. This API is used for requesting entering the
 * target mode, the final SOC power mode depends on hardware aggregation. Note, the Sense domain can enter DSR mode only
 * when Compute domain is in DSR. The SOC enters DPD or FDPD when both domain requested entering DPD or FDPD.
 *
 * @param mode  Power mode to enter.
 * @param exclude_from_pd  Bit mask of the SLEEPCON_SLEEPCFG and PMC_PDSLEEPCFG0 ~ PMC_PDSLEEPCFG5 that needs to be
 * powered on during power mode selected.
 */
void POWER_EnterPowerMode(power_mode_cfg_t mode, const uint32_t exclude_from_pd[7]);

/*!
 * @brief Power Library API to return the library version.
 *
 * @return version number of the power library
 */
uint32_t POWER_GetLibVersion(void);

#ifdef __cplusplus
}
#endif

/*!
 * @}
 */

#endif /* FSL_POWER_H_ */
